<table align="left" width=100%>
    <tr>
        <td width="20%">
            <img src="GL-2.png">
        </td>
        <td>
            <div align="center">
                <font color="#21618C" size=8px>
                    <b>Practice Set <br> (Week 3)
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

### Let's begin with some hands-on practice exercises

<table align="left" width=100%>
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left">
                <font color="#21618C" size=4px>
                    <b> 1. Compute minimum and maximum sales for each store and location
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the dataframe given below:**
   
<table>
<tr>
<th>Store</th>
<th>Location</th>
<th>Sales</th>
</tr>
<tr>
<td>A</td>
<td>Mumbai</td>
<td>40000</td>
</tr>
<tr>
<td>B</td>
<td>Pune</td>
<td>45000</td>
</tr>
<tr>
<td>A</td>
<td>Hyderabad</td>
<td>50000</td>
</tr>
<tr>
<td>C</td>
<td>Mumbai</td>
<td>90000</td>
</tr>
<tr>
<td>D</td>
<td>Pune</td>
<td>89000</td>
</tr>
<tr>
<td>A</td>
<td>Delhi</td>
<td>87000</td>
</tr>
<tr>
<td>D</td>
<td>Hyderabad</td>
<td>85000</td>
</tr>
<tr>
<td>A</td>
<td>Pune</td>
<td>78000</td>
</tr>
<tr>
<td>C</td>
<td>Mumbai</td>
<td>89000</td>
</tr>
<tr>
<td>B</td>
<td>Pune</td>
<td>70000</td>
</tr>
   
</table>

<table align="left" width=100%>
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left">
                <font color="#21618C" size=4px>
                    <b> 2. Find duplicate rows based on the column 'Name'
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the dataframe given below:**
   
<table>
<tr>
<th>Name</th>
<th>Salary</th>
<th>City</th>
</tr>
<tr>
<td>John</td>
<td>3400</td>
<td>Sydeny</td>
</tr>
<tr>
<td>Robert</td>
<td>3000</td>
<td>Chicago</td>
</tr>
<tr>
<td>Aadi</td>
<td>1600</td>
<td>New York</td>
</tr>
<tr>
<td>Robert</td>
<td>3000</td>
<td>Chicago</td>
</tr>
<tr>
<td>Robert</td>
<td>3000</td>
<td>Chicago</td>
</tr>
<tr>
<td>Robert</td>
<td>3000</td>
<td>Texas</td>
</tr>
<tr>
<td>Aadi</td>
<td>4000</td>
<td>London</td>
</tr>
<tr>
<td>Sachin</td>
<td>3000</td>
<td>Chicago</td>
</tr>
   
</table>

<table align="left" width=100%>
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left">
                <font color="#21618C" size=4px>
                    <b> 3.  In column tournament, replace all the 'football' values  with 'cricket'
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

 
<table>
<tr>
<th>Days</th>
<th>Tournament</th>
</tr>
<tr>
<td>Mon</td>
<td>Football</td>
</tr>
<tr>
<td>Tues</td>
<td>Cricket</td>
</tr>
<tr>
<td>Wed</td>
<td>Football</td>
</tr>
<tr>
<td>Thurs</td>
<td>Football</td>
</tr>
<tr>
<td>Fri</td>
<td>Cricket</td>
</tr>
   
</table>

<table align="left" width=100%>
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left">
                <font color="#21618C" size=4px>
                    <b> 4. Create a new column age with values of your choice. And append it to the below dataframe.
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the dataframe given below:**
   
<table>
<tr>
<th>Name</th>
<th>Maths</th>
<th>Science</th>
<th>English</th>
</tr>
<tr>
<td>Emma</td>
<td>56</td>
<td>89</td>
<td>89</td>
</tr>
<tr>
<td>Mia</td>
<td>78</td>
<td>87</td>
<td>89</td>
</tr>
<tr>
<td>Sophia</td>
<td>78</td>
<td>78</td>
<td>76</td>
</tr>
<tr>
<td>James</td>
<td>67</td>
<td>89</td>
<td>78</td>
</tr>
<td>John</td>
<td>88</td>
<td>78</td>
<td>87</td>
</tr>  
</table>

<table align="left" width=100%>
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left">
                <font color="#21618C" size=4px>
                    <b> 5. Perform right join to combine values based on the columns 'MA(Hons)' and 'Stud_ID' in the two dataframes
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the dataframe given below:**
   
<table>
    <tr>
        <th>Stud_ID</th>
        <th>Name</th>
        <th>MA(Hons)</th>
    </tr>
    <tr>
        <td>101</td>
        <td>Alex</td>
        <td>History</td>
    </tr>
    <tr>
        <td>102</td>
        <td>Amy</td>
        <td>English</td>
    </tr>
    <tr>
        <td>103</td>
        <td>Allen</td>
        <td>Geography</td>
    </tr>
    <tr>
        <td>104</td>
        <td>Alice</td>
        <td>German</td>
    </tr>
        <td>105</td>
        <td>James</td>
        <td>History</td>
    </tr>  
</table>
<br>



<table>
    <tr>
        <th>Stud_ID</th>
        <th>Res_City</th>
        <th>MA(Hons)</th>
    </tr>
    <tr>
        <td>101</td>
        <td>Delhi</td>
        <td>English</td>
    </tr>
    <tr>
        <td>102</td>
        <td>Mumbai</td>
        <td>History</td>
    </tr>
    <tr>
        <td>103</td>
        <td>Delhi</td>
        <td>Fine Arts</td>
    </tr>
    <tr>
        <td>104</td>
        <td>Chennai</td>
        <td>German</td>
    </tr>
        <td>105</td>
        <td>Hyderabad</td>
        <td>History</td>
    </tr>
</table>

<table align="left" width=100%>
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left">
                <font color="#21618C" size=4px>
                    <b> 6. Using the dataframes created in question 6, perform inner join to combine values based on the columns 'MA(Hons)' and 'Stud_ID' in the two dataframes
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

<table align="left" width=100%>
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left">
                <font color="#21618C" size=4px>
                    <b> 7. Concatenate two dataframes along the columns
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the dataframe given below:**
   
<table>
    <tr>
        <th>Stud_ID</th>
        <th>Name</th>
    </tr>
    <tr>
        <td>101</td>
        <td>Alex</td>
    </tr>
    <tr>
        <td>102</td>
        <td>Amy</td>
    </tr>
    <tr>
        <td>103</td>
        <td>Allen</td>
    <tr>
        <td>104</td>
        <td>Alice</td>
    </tr>
        <td>105</td>
        <td>James</td>
    </tr>  
</table>
<br>



<table>
    <tr>
        <th>Res_City</th>
        <th>MA(Hons)</th>
    </tr>
    <tr>
        <td>Delhi</td>
        <td>English</td>
    </tr>
    <tr>
        <td>Mumbai</td>
        <td>History</td>
    </tr>
    <tr>
        <td>Delhi</td>
        <td>Fine Arts</td>
    </tr>
    <tr>
        <td>Chennai</td>
        <td>German</td>
    </tr>
        <td>Hyderabad</td>
        <td>History</td>
    </tr>
</table>

<table align="left" width=100%>
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left">
                <font color="#21618C" size=4px>
                    <b> 8. Calculate minimum, maximum and average sales for each season
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the dataframe given below:**
   
<table>
<tr>
<th>Month</th>
<th>Sales</th>
<th>Seasons</th>
</tr>
<tr>
<td>Jan</td>
<td>22000</td>
<td>Winter</td>
</tr>
<tr>
<td>Feb</td>
<td>27000</td>
<td>Winter</td>
</tr>
<tr>
<td>Mar</td>
<td>25000</td>
<td>Spring</td>
</tr>
<tr>
<td>Apr</td>
<td>29000</td>
<td>Spring</td>
</tr>
<tr>
<td>May</td>
<td>35000</td>
<td>Spring</td>
</tr>
<tr>
<td>June</td>
<td>67000</td>
<td>Summer</td>
</tr>
<tr>
<td>July</td>
<td>78000</td>
<td>Summer</td>
</tr>
<tr>
<td>Aug</td>
<td>67000</td>
<td>Summer</td>
</tr>
<tr>
<td>Sep</td>
<td>56000</td>
<td>Fall</td>
</tr>
<tr>
<td>Oct</td>
<td>56000</td>
<td>Fall</td>
</tr>
<tr>
<td>Nov</td>
<td>56000</td>
<td>Fall</td>
</tr>
<tr>
<td>Dec</td>
<td>60000</td>
<td>Winter</td>
</tr>

</table>

<table align="left" width=100%>
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left">
                <font color="#21618C" size=4px>
                    <b> 9. Find all the duplicate entries based on the columns X and Y.
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the dataframe given below:**
   
<table>
<tr>
<th>X</th>
<th>Y</th>
<th>Z</th>
</tr>
<tr>
<td>1</td>
<td>2</td>
<td>5</td>
</tr>
<tr>
<td>2</td>
<td>2</td>
<td>6</td>
</tr>
<tr>
<td>3</td>
<td>1</td>
<td>2</td>
</tr>
<tr>
<td>1</td>
<td>2</td>
<td>6</td>
</tr>
<tr>
<td>2</td>
<td>2</td>
<td>1</td>
</tr>
<tr>
<td>3</td>
<td>4</td>
<td>6</td>
</tr>
<tr>
<td>2</td>
<td>2</td>
<td>2</td>
</tr>
<tr>
<td>2</td>
<td>2</td>
<td>8</td>
</tr>

</table>

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 10. Plot a horizontal bar chart and vertical bar chart for the following data.
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

<table>
<tr>
    <th>Name</th>
    <td>Sheldon</td>
    <td>Amy</td>
    <td>Priya</td>
    <td>Raj</td>  
</tr>
<tr>
    <th>Maths</th>
    <td>72</td>
    <td>34</td>
    <td>54</td>
    <td>76</td>  
</tr>
<tr>
    <th>Geography</th>
    <td>98</td>
    <td>98</td>
    <td>78</td>
    <td>87</td>  
  </tr>
</table>

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 11. Following is data on 10 people, information on the number of dependents on each of them and their income is given. Draw a dual-axis plot.
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

<table>
<tr>
    <th>Person</th>
    <td>No. of Dependents</td>
    <td>Income</td>
</tr>
<tr>
    <th>1</th>
    <td>1</td>
    <td>60000</td>  
</tr>
<tr>
    <th>2</th>
    <td>2</td>
    <td>52000</td>
</tr>
<tr>
    <th>3</th>
    <td>0</td>
    <td>50000</td>  
</tr>
<tr>
    <th>4</th>
    <td>3</td>
    <td>65000</td>
</tr>
<tr>
    <th>5</th>
    <td>0</td>
    <td>45500</td>  
</tr>
<tr>
    <th>6</th>
    <td>1</td>
    <td>43050</td>
</tr>
<tr>
    <th>7</th>
    <td>0</td>
    <td>54300</td>  
</tr> 
<tr>
    <th>8</th>
    <td>0</td>
    <td>38000</td>
</tr>
<tr>
    <th>9</th>
    <td>2</td>
    <td>20000</td>
</tr>
<tr>
    <th>10</th>
    <td>1</td>
    <td>47500</td>  
    </tr>
</table>

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 12. Use the following data to plot a pie chart and annotate the percentage sales.
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

<table>
  <tr>
  <th>Location</th>
  <th>Sale</th>
  </tr>
  <tr>
  <td>Delhi</td>
  <td>42500</td>
  </tr>
  <tr>
  <td>Bangalore</td>
  <td>44500</td>
  </tr>
  <tr>
  <td>Chennai</td>
  <td>48300</td>
  </tr>
  <tr>
  <td>Pune</td>
  <td>52400</td>
  </tr>
  <tr>
  <td>Kolkata</td>
  <td>61800</td>
  </tr> 
</table>

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 13. Write a program to plot a bar plot of seven students representing their marks in Mathematics using plotly. 
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

        marks = [76,98,78,98,89,56,69,76]
        students = ['Sheldon','Leonard','Raj','Howard','Amy','Penny','Bernadette']

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 14. Import the flights data set and plot a line plot for the variable 'passengers'.
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 15. Import the iris data set and plot a heatmap of the correlation between its numeric variables.
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 16. Using the iris data set, plot boxplot of its numeric features.
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 17. Import the built-in 'diamonds' data set from seaborn. For the variable 'cut', plot a count plot.
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 18. Use the iris data set, to plot a joint plot of sepal length against sepal width.
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b> 19. Jake's monthly expenditure is given below. Draw a pie chart and explode the wedge with highest cost
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

<table>
    <tr>
        <th> Item  </th>
        <th> Expenditure </th>
    </tr>
    <tr>
        <th> Food </th>
        <th> 15</th>
    </tr>
    <tr>
        <th> Clothing </th>
        <th> 10</th>
    </tr>
    <tr>
        <th> Rent </th>
        <th> 40 </th>
    </tr>
    <tr>
        <th> Education </th>
        <th> 25</th>
    </tr>
    <tr>
        <th> Unforseen Events </th>
        <th> 5</th>
    </tr>
    <tr>
        <th> Medicine </th>
        <th>5</th>
    </tr>
</table>